spawn ttyNM_J6Eco
picocom v1.4

port is        : /dev/ttyNM_J6Eco
flowcontrol    : none
baudrate is    : 115200
parity is      : none
databits are   : 8
escape is      : C-a
noinit is      : yes
noreset is     : yes
nolock is      : yes
send_cmd is    : ascii_xfr -s -v -l10
receive_cmd is : rz -vv

Terminal ready

U-Boot SPL 2013.10-00204-g6d29e34 (May 30 2014 - 12:05:04)
DRA722 ES1.0

 DRA iterations=20SPL: Please implement spl_start_uboot() for your board
SPL: Direct Linux boot not active!
reading u-boot.img
reading u-boot.img


U-Boot 2013.10-00204-g6d29e34 (May 30 2014 - 12:05:04)

CPU  : DRA722 ES1.0
Board: DRA7xx
I2C:   ready
DRAM:  1 GiB
NAND:  0 MiB
MMC:   OMAP SD/MMC: 0, OMAP SD/MMC: 1
*** Error - No Valid Environment Area found
*** Warning - bad CRC, using default environment

SATA link 0 timeout.
AHCI 0001.0300 32 slots 1 ports 3 Gbps 0x1 impl SATA mode
flags: 64bit ncq stag pm led clo only pmp pio slum part ccc apst 
scanning bus for devices...
Found 0 device(s).
Net:   <ethaddr> not set. Validating first E-fuse MAC
cpsw
Hit any key to stop autoboot:  3  2  1  0 
(Re)start USB...
USB0:   Register 2000140 NbrPorts 2
Starting the controller
USB XHCI 1.00
scanning bus 0 for devices... 1 USB Device(s) found
       scanning usb for storage devices... 0 Storage Device(s) found

USB device 0: unknown device
mmc0 is current device
Scanning mmc 0...
** File not found /boot/zImage **
mmc0 is current device
SD/MMC found on device 0
reading uEnv.txt
790 bytes read in 5 ms (154.3 KiB/s)
Loaded environment from
Importing environment from mmc0 ...
Running uenvcmd ...
network start
++1
link up on port 1, speed 100, full duplex
BOOTP broadcast 1
DHCP client bound to address 128.247.91.165
Using cpsw device
TFTP from server 128.247.91.123; our IP address is 128.247.91.165
Filename '/tftpboot/kernel/dra72-evm.dtb'.
Load address: 0x80f80000
Loading: *
TFTP error: 'File not found' (1)
Not retrying...
++2
++3
link up on port 1, speed 100, full duplex
BOOTP broadcast 1
DHCP client bound to address 128.247.91.165
Using cpsw device
TFTP from server 128.247.91.123; our IP address is 128.247.91.165
Filename '/tftpboot/kernel/zImage'.
Load address: 0x80200000
Loading: *#################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 ######
	 801.8 KiB/s
done
Bytes transferred = 4689752 (478f58 hex)
++4
network stop
reading /ramdisk.gz
3543639 bytes read in 199 ms (17 MiB/s)
Kernel image @ 0x80200000 [ 0x000000 - 0x478f58 ]
ERROR: Did not find a cmdline Flattened Device Tree
Could not find a valid device tree
++3
link up on port 1, speed 100, full duplex
BOOTP broadcast 1
DHCP client bound to address 128.247.91.165
Using cpsw device
TFTP from server 128.247.91.123; our IP address is 128.247.91.165
Filename '/tftpboot/kernel/zImage'.
Load address: 0x80200000
Loading: *#################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 ######
	 801.8 KiB/s
done
Bytes transferred = 4689752 (478f58 hex)
++4
++1
link up on port 1, speed 100, full duplex
BOOTP broadcast 1
DHCP client bound to address 128.247.91.165
Using cpsw device
TFTP from server 128.247.91.123; our IP address is 128.247.91.165
Filename '/tftpboot/kernel/dra72-evm.dtb'.
Load address: 0x80f80000
Loading: *
TFTP error: 'File not found' (1)
Not retrying...
++2
Booting from mmc0 ...
Kernel image @ 0x80200000 [ 0x000000 - 0x478f58 ]
ERROR: Did not find a cmdline Flattened Device Tree
Could not find a valid device tree
mmc1(part 0) is current device
SD/MMC found on device 1
** Unrecognized filesystem type **
Running uenvcmd ...
network start
++1
link up on port 1, speed 100, full duplex
BOOTP broadcast 1
DHCP client bound to address 128.247.91.165
Using cpsw device
TFTP from server 128.247.91.123; our IP address is 128.247.91.165
Filename '/tftpboot/kernel/dra72-evm.dtb'.
Load address: 0x80f80000
Loading: *
TFTP error: 'File not found' (1)
Not retrying...
++2
++3
link up on port 1, speed 100, full duplex
BOOTP broadcast 1
DHCP client bound to address 128.247.91.165
Using cpsw device
TFTP from server 128.247.91.123; our IP address is 128.247.91.165
Filename '/tftpboot/kernel/zImage'.
Load address: 0x80200000
Loading: *#################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 ######
	 801.8 KiB/s
done
Bytes transferred = 4689752 (478f58 hex)
++4
network stop
** Unrecognized filesystem type **
Kernel image @ 0x80200000 [ 0x000000 - 0x478f58 ]
ERROR: Did not find a cmdline Flattened Device Tree
Could not find a valid device tree
++3
link up on port 1, speed 100, full duplex
BOOTP broadcast 1
DHCP client bound to address 128.247.91.165
Using cpsw device
TFTP from server 128.247.91.123; our IP address is 128.247.91.165
Filename '/tftpboot/kernel/zImage'.
Load address: 0x80200000
Loading: *#################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 #################################################################
	 ######
	 800.8 KiB/s
done
Bytes transferred = 4689752 (478f58 hex)
++4
++1
link up on port 1, speed 100, full duplex
BOOTP broadcast 1
DHCP client bound to address 128.247.91.165
Using cpsw device
TFTP from server 128.247.91.123; our IP address is 128.247.91.165
Filename '/tftpboot/kernel/dra72-evm.dtb'.
Load address: 0x80f80000
Loading: *
TFTP error: 'File not found' (1)
Not retrying...
++2
Booting from mmc1 ...
Kernel image @ 0x80200000 [ 0x000000 - 0x478f58 ]
ERROR: Did not find a cmdline Flattened Device Tree
Could not find a valid device tree
Booting from nand ...

no devices available

no devices available
Kernel image @ 0x80200000 [ 0x000000 - 0x478f58 ]
ERROR: Did not find a cmdline Flattened Device Tree
Could not find a valid device tree
U-Boot# root
Unknown command 'root' - try 'help'
U-Boot# 
Unknown command 'root' - try 'help'
U-Boot# 
Unknown command 'root' - try 'help'
U-Boot# 
Unknown command 'root' - try 'help'
U-Boot# 
Unknown command 'root' - try 'help'
U-Boot# 
Unknown command 'root' - try 'help'
U-Boot# mount -t proc proc /proc
Unknown command 'mount' - try 'help'
U-Boot# 
Unknown command 'mount' - try 'help'
U-Boot# 
Unknown command 'mount' - try 'help'
U-Boot# mount -t sysfs sys /sys
Unknown command 'mount' - try 'help'
U-Boot# 
Unknown command 'mount' - try 'help'
U-Boot# 
Unknown command 'mount' - try 'help'
U-Boot# mount -t debugfs none /sys/kernel/debug
Unknown command 'mount' - try 'help'
U-Boot# 
Unknown command 'mount' - try 'help'
U-Boot# 
Unknown command 'mount' - try 'help'
U-Boot# cat /proc/cpuinfo
Unknown command 'cat' - try 'help'
U-Boot# 
Unknown command 'cat' - try 'help'
U-Boot# 
Unknown command 'cat' - try 'help'
U-Boot# cat /proc/interrupts
Unknown command 'cat' - try 'help'
U-Boot# 
Unknown command 'cat' - try 'help'
U-Boot# 
Unknown command 'cat' - try 'help'
U-Boot# head /sys/devices/soc0/* 2>/dev/null
Unknown command 'head' - try 'help'
U-Boot# 
Unknown command 'head' - try 'help'
U-Boot# 
Unknown command 'head' - try 'help'
U-Boot# cat /sys/kernel/debug/clk/clk_summary
Unknown command 'cat' - try 'help'
U-Boot# 
Unknown command 'cat' - try 'help'
U-Boot# 
Unknown command 'cat' - try 'help'
U-Boot# ls /sys/kernel/debug/clk/orphans/
** No device specified **
U-Boot# 
** No device specified **
U-Boot# 
** No device specified **
U-Boot# echo 'H''ello World' 'B''oard Booted'
Hello World Board Booted
U-Boot# 
Hello World Board Booted
U-Boot# 
Hello World Board Booted
U-Boot# sync;poweroff
Unknown command 'sync' - try 'help'
Unknown command 'poweroff' - try 'help'
U-Boot# 
Unknown command 'sync' - try 'help'
Unknown command 'poweroff' - try 'help'
U-Boot# 
Unknown command 'sync' - try 'help'
Unknown command 'poweroff' - try 'help'
U-Boot# 
Skipping tty reset...
Thanks for using picocom
